In [60]:
import requests
import pandas as pd
import matplotlib.pyplot as plt

In [61]:
#Parametros
#qtd 'n' de linhas (registros)

In [62]:
qtd =500
url = "https://randomuser.me/api/?results={}".format(qtd)

In [63]:
#coletar dados da API

In [64]:
dft = requests.get(url)

In [65]:
x = dft.json()

In [66]:
df = pd.DataFrame(x['results'])

In [107]:
dfloc =pd.json_normalize(df['location'])

In [112]:
dfloc.groupby(['country']).count()

,city,state,postcode,street.number,street.name,coordinates.latitude,coordinates.longitude,timezone.offset,timezone.description
country,,,,,,,,,
Australia,25,25,25,25,25,25,25,25,25
Brazil,31,31,31,31,31,31,31,31,31
Canada,17,17,17,17,17,17,17,17,17
Denmark,31,31,31,31,31,31,31,31,31
Finland,25,25,25,25,25,25,25,25,25
France,16,16,16,16,16,16,16,16,16
Germany,24,24,24,24,24,24,24,24,24
India,18,18,18,18,18,18,18,18,18
Iran,20,20,20,20,20,20,20,20,20
Ireland,16,16,16,16,16,16,16,16,16
Mexico,27,27,27,27,27,27,27,27,27
Netherlands,18,18,18,18,18,18,18,18,18
New Zealand,23,23,23,23,23,23,23,23,23
Norway,23,23,23,23,23,23,23,23,23
Serbia,30,30,30,30,30,30,30,30,30
Spain,21,21,21,21,21,21,21,21,21
Switzerland,26,26,26,26,26,26,26,26,26
Turkey,32,32,32,32,32,32,32,32,32
Ukraine,20,20,20,20,20,20,20,20,20
United Kingdom,27,27,27,27,27,27,27,27,27
United States,30,30,30,30,30,30,30,30,30

In [110]:
ctr=dfloc.groupby(['country','state']).count()

In [115]:
ctr.head(20)

                                        city  postcode  street.number  \
country   state
Australia Australian Capital Territory     4         4              4
          New South Wales                  2         2              2
          Northern Territory               4         4              4
          Queensland                       1         1              1
          South Australia                  7         7              7
          Tasmania                         3         3              3
          Victoria                         4         4              4
Brazil    Acre                             2         2              2
          Alagoas                          1         1              1
          Amapá                            2         2              2
          Amazonas                         2         2              2
          Bahia                            1         1              1
          Distrito Federal                 3         3              3
          Espírito Santo                   1         1              1
          Goiás                            2         2              2
          Maranhão                         1         1              1
          Mato Grosso                      1         1              1
          Minas Gerais                     1         1              1
          Paraná                           1         1              1
          Pernambuco                       1         1              1

                                        street.name  coordinates.latitude  \
country   state
Australia Australian Capital Territory            4                     4
          New South Wales                         2                     2
          Northern Territory                      4                     4
          Queensland                              1                     1
          South Australia                         7                     7
          Tasmania                                3                     3
          Victoria                                4                     4
Brazil    Acre                                    2                     2
          Alagoas                                 1                     1
          Amapá                                   2                     2
          Amazonas                                2                     2
          Bahia                                   1                     1
          Distrito Federal                        3                     3
          Espírito Santo                          1                     1
          Goiás                                   2                     2
          Maranhão                                1                     1
          Mato Grosso                             1                     1
          Minas Gerais                            1                     1
          Paraná                                  1                     1
          Pernambuco                              1                     1

                                        coordinates.longitude  \
country   state
Australia Australian Capital Territory                      4
          New South Wales                                   2
          Northern Territory                                4
          Queensland                                        1
          South Australia                                   7
          Tasmania                                          3
          Victoria                                          4
Brazil    Acre                                              2
          Alagoas                                           1
          Amapá                                             2
          Amazonas                                          2
          Bahia                                             1
          Distrito Federal                                  3
          Espírito Santo                                    1
          Goiás                                             2
          Maranhão                                          1
          Mato Grosso                                       1
          Minas Gerais                                      1
          Paraná                                            1
          Pernambuco                                        1

                                        timezone.offset  timezone.description
country   state
Australia Australian Capital Territory                4                     4
          New South Wales                             2                     2
          Northern Territory                          4                     4
          Queensland                                  1                     1
          South Australia                             7                     7
          Tasmania                                    3                     3
          Victoria                                    4                     4
Brazil    Acre                                        2                     2
          Alagoas                                     1                     1
          Amapá                                       2                     2
          Amazonas                                    2                     2
          Bahia                                       1                     1
          Distrito Federal                            3                     3
          Espírito Santo                              1                     1
          Goiás                                       2                     2
          Maranhão                                    1                     1
          Mato Grosso                                 1                     1
          Minas Gerais                                1                     1
          Paraná                                      1                     1
          Pernambuco                                  1                     1

In [100]:
ctr.apply(lambda x:100 * x / float(x.sum()))

                country
country
Australia           5.0
Brazil              6.2
Canada              3.4
Denmark             6.2
Finland             5.0
France              3.2
Germany             4.8
India               3.6
Iran                4.0
Ireland             3.2
Mexico              5.4
Netherlands         3.6
New Zealand         4.6
Norway              4.6
Serbia              6.0
Spain               4.2
Switzerland         5.2
Turkey              6.4
Ukraine             4.0
United Kingdom      5.4
United States       6.0

In [67]:
#salvar o resultado em um arquivo CSV

In [59]:
df.to_csv('randomuser.csv', sep=',', encoding='utf-8')

In [ ]:
#padronizando formato de telefone e celular, transformá-los para um formato único, escolhido arbitrariament

In [61]:
#retirando de phone caracteres 'espaço' ( - )
p = df['phone'].replace('\(','',regex=True)
p = p.replace(' ','',regex=True)
p = p.replace('\)','',regex=True)
p = p.replace('-','',regex=True)
# substituindo phone com novo formato
df['phone'] = '(' + p.str[:3] + ')' + p.str[3:6] + '-' + p.str[6:11]

In [62]:
 '(' + p.str[:3] + ')' + p.str[3:6] + '-' + p.str[6:11]

0     (047)383-9008
1     (052)452-1150
2       (059)380-12
3     (079)526-5852
4     (016)977-4098
5     (046)434-0665
6     (856)347-1181
7    (013)873-51704
8     (033)215-1432
9       (036)966-96
Name: phone, dtype: object

In [37]:
#retirando de cell caracteres 'espaço' ( - )
c = df['cell'].replace('\(','',regex=True)
c = c.replace(' ','',regex=True)
c = c.replace('\)','',regex=True)
c = c.replace('-','',regex=True)
# substituindo cell com novo formato
df['cell'] = '(' + c.str[:3] + ')' + c.str[3:6] + '-' + c.str[6:11]

In [ ]:
#grupamento por gênero

In [68]:
#ordenar e contagem por gênero
df.sort_values(['gender'])
sex=df.groupby(df['gender']).agg({'name':'count'})

In [69]:
sex.apply(lambda x:100 * x / float(x.sum()))

        name
gender
female  49.0
male    51.0

In [19]:
df['name'].head(10)

0    {'title': 'Mrs', 'first': 'Sissi', 'last': 'Kr...
1    {'title': 'Mr', 'first': 'Timoteo', 'last': 'G...
2    {'title': 'Miss', 'first': 'Vanessa', 'last': ...
3    {'title': 'Mr', 'first': 'Mikael', 'last': 'Pe...
4    {'title': 'Miss', 'first': 'Brooklyn', 'last':...
5    {'title': 'Mr', 'first': 'Jose', 'last': 'Mart...
6    {'title': 'Mr', 'first': 'Genaro', 'last': 'Ro...
7    {'title': 'Miss', 'first': 'Carlota', 'last': ...
8    {'title': 'Miss', 'first': 'Nezabudka', 'last'...
9    {'title': 'Mr', 'first': 'Gökhan', 'last': 'Ak...
Name: name, dtype: object

In [ ]:
#grupamento por pais

In [48]:
#ordenar e contagem por pais
df.sort_values(['nat'])
city=df.groupby(df['nat']).agg({'name':'count'})

In [70]:
city

     name
nat
AU     23
BR     16
CA     32
CH     25
DE     23
DK     23
ES     26
FI     14
FR     23
GB     30
IE     24
IN     27
IR     16
MX     23
NL     19
NO     31
NZ     32
RS     19
TR     23
UA     26
US     25

In [71]:
city.apply(lambda x:100 * x / float(x.sum()))

     name
nat
AU    4.6
BR    3.2
CA    6.4
CH    5.0
DE    4.6
DK    4.6
ES    5.2
FI    2.8
FR    4.6
GB    6.0
IE    4.8
IN    5.4
IR    3.2
MX    4.6
NL    3.8
NO    6.2
NZ    6.4
RS    3.8
TR    4.6
UA    5.2
US    5.0

In [63]:
df.sort_values(['gender'])
sex = df.groupby(df['gender']).agg({'name':'count'})